In [30]:
import pandas as pd

In [31]:
sr1 = pd.Series([0,1,2,3])
sr1

0    0
1    1
2    2
3    3
dtype: int64

In [32]:
sr2 = pd.Series([4, 5, 6, 7])
sr2

0    4
1    5
2    6
3    7
dtype: int64

In [33]:
pd.concat([sr1, sr2])

0    0
1    1
2    2
3    3
0    4
1    5
2    6
3    7
dtype: int64

In [34]:
df1 = pd.DataFrame({
    'Id': [1,2,3,4],
    'Name': ['A', 'B', 'C', 'D'],
    'Class': [5, 6, 7, 8]
})
df1

   Id Name  Class
0   1    A      5
1   2    B      6
2   3    C      7
3   4    D      8

In [35]:
df2 = pd.DataFrame({
    'Id': [5,6,7,8],
    'Name': ['E', 'F', 'G', 'H'],
    'Class': [9, 10, 11, 12]
})
df2

   Id Name  Class
0   5    E      9
1   6    F     10
2   7    G     11
3   8    H     12

In [36]:
pd.concat([df1, df2])

   Id Name  Class
0   1    A      5
1   2    B      6
2   3    C      7
3   4    D      8
0   5    E      9
1   6    F     10
2   7    G     11
3   8    H     12

In [37]:
pd.concat([df1, df2], axis=1)

   Id Name  Class  Id Name  Class
0   1    A      5   5    E      9
1   2    B      6   6    F     10
2   3    C      7   7    G     11
3   4    D      8   8    H     12

In [ ]:
pd.concat([df1, df2], axis=0)